#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>


////算术操作符
//// + - * / %
////除%外其它算术操作符均可作用与整数和浮点数
//int main()
//{
//	double a = 5 % 2;
//	printf("%lf", a);
//	return 0;
//}




//
////位移操作符
////<< >>不能移动负数位，例如a<<-1
//int main()
//{
//	////int a = 16;//内存存储的是补码，正数的原码，反码，补码都一样
//	//////16-->00000000000000000000000000010000
//	//////b -->00000000000000000000000000100000//左移操作符，右边丢弃，左边补零
//	//int a = -1;
//	////a -->10000000000000000000000000000001  原码
//	////     11111111111111111111111111111110  反码
//	////     11111111111111111111111111111111  补码
//	////b -->11111111111111111111111111111110  补码
//	//       11111111111111111111111111111101  反码
//	//       10000000000000000000000000000010  原码
//	//int b = a << 1;
//	//int a = 16;
//	////////16-->00000000000000000000000000010000
//	////////b -->00000000000000000000000000100000//右移操作符，左边丢弃，右边补原符号位
//	int a = -1;
//	//a-->10000000000000000000000000000001  原码
//	//    11111111111111111111111111111110  反码
//	////  11111111111111111111111111111111  补码
//	//b-->11111111111111111111111111111111  补码
//	//    11111111111111111111111111111110  反码
//	//    10000000000000000000000000000001  原码 
//	int b = a >> 1;
//	printf("%d", b);
//	return 0;
//}





////位操作符
////&按位与 |按位或 ^按位异或  操作数必须是整数
//int main()
//{
//	//int a = 3;    //000000000000000000000000000000011
//	//int b = 4;    //000000000000000000000000000000100
//	//int c = a & b;//000000000000000000000000000000000
//	//printf("%d\n", c);//全1为1，有0则0
//	//return 0;
//	//int a = 3;     //000000000000000000000000000000011
//	//int b = 4;     //000000000000000000000000000000100
//	//int c = a | b; //000000000000000000000000000000111
//	//printf("%d", c);//有1为1，全0则0
//	//return 0;
//	int a = 3;     //000000000000000000000000000000011
//	int b = 4;     //000000000000000000000000000000100
//	int c = a ^ b; //000000000000000000000000000000111
//	printf("%d", c);//相同为0，相异为1
//	return 0;
//}





////不使用第三个变量去交换两个变量
//int main()
//{
//	int a = 3;
//	int b = 5;
//	printf("交换前：%d   %d\n", a, b);
//	//加减法
//	/*
//	a = a + b;//8
//	b = a - b;//3
//	a = a - b;//5
//	*/
//	//异或法
//	a = a ^ b;//0011^0110==0101  5
//	b = a ^ b;//0101^0110==0011  3
//	a = a ^ b;//0101^0011==0110  5
//	printf("交换后：%d   %d\n", a, b);
//	return 0;
//}





////计算一个数字二进制的1的数量
//int main()
//{
//	int num = 0;
//	int count=0;
//	int i = 0;
//	scanf("%d", &num);
//	/*while (num)
//	{
//		if (num % 2 == 1)
//			count++;
//		num = num / 2;
//
//	}*/
//	for (i = 0; i < 32; i++)
//	{
//		if (((num >> i) & 1) == 1)
//			count++;
//	}
//	printf("%d\n", count);
//	return 0;
//}








//赋值操作符=
//复合赋值符
//+=  -=  *=  /=  %=  >>=  <<=  &=  |=  ^= 


////单目操作符
////只有一个操作数
////！ - + & sizeof ~ -- ++ * （类型）
//int main()
//{
//	int a = 0;//                           00000000000000000000000000000000
//	int b = ~a;//按位取反（所有数字都取反）11111111111111111111111111111111 由于负数为变为了1，该二进制是负数的补码
//	printf("%d", b);//                     11111111111111111111111111111110 反码
//	//                                     10000000000000000000000000000001 原码
//	return 0;
//前置++，后置++
//int main()
//{
//	int a = 5;
//	//printf("%d\n", a++);//先使用，后++
//	//printf("%d\n", ++a);//先++，后使用
//	
//	return 0;
//}
//强制类型转换
//int main()
//{
//	int a = (int)3.14;
//	printf("%d", a);
//	return 0;
//}






////逻辑运算符
////&&逻辑与  ||逻辑或
//int main()
//{
//	int a = 3;
//	int b = 0;
//	//int c = a && b;//逻辑与，有假为假，全真为真
//	int c = a || b;//逻辑或，有真为真，全假为假
//	printf("%d", c);
//	return 0;
//}





//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	//i = a++ && ++b && d++;//a++先使用a，后自增，0&&++b&&d++这个式子由于有0，&&后面不再运算
//	i = a++ || ++b || d++;//0||3||d++，由于3是真，则3后面的式子不再进行运算
//	printf("a=%d\nb=%d\nc=%d\nd=%d\n", a, b, c, d);//1，2，3，4
//	return 0;
//}





////三目操作符（条件操作符）
////exp1?exp2:exp3
//int main()
//{
//	int a = 20;
//	int b = 10;
//	int max;
//	/*if (a > b)
//		max = a;
//	else
//		max = b;*/
//	max = (a > b ? a : b);
//	return 0;
//}






////逗号表达式
////将几个表达式从左到右依次用逗号隔开，依次进行计算，结果等于最后一个
//int main()
//{
//	/*a = get_val();
//	count_val(a);
//	while (a > 0)
//	{
//		a = get_val();
//		count_val(a);
//	}*/
//
//	while (a = get_val(), count_val(a), a > 0)
//	{
//		a = get_val();
//		count_val(a);
//	}
//}




////下标引用操作符
////[]
//int main()
//{
//	int arr[10] = { 0 ,1,2,3,4,5,6,7,8,9};
//	int b = arr[4];
//	printf("%d", b);
//	return 0;
//}





////函数调用操作符
////()
//int max_number(int a, int b)
//{
//	return (a > b ? a : b);
//}
//int main()
//{
//	int a = 3, b = 4;
//	int max;
//	max = max_number(a, b);
//	printf("%d", max);
//	return 0;
//}




////结构体操作符
////.  结构体.成员名
////->  结构体指针->成员名
//struct student
//{
//	char name[20];
//	int age;
//	int id;
//};
//int main()
//{
//	struct student s1 = { "刘荣锦",22,210399 };
//	struct student* p = &s1;
//
//	printf("%s\n", p->name);
//	printf("%d\n", p->age);
//	printf("%d\n", p->id);
//	/*printf("%s\n", (*p).name);
//	printf("%d\n", (*p).age);
//	printf("%d\n", (*p).id);*/
//
//	/*printf("%s\n", s1.name);
//	printf("%d\n", s1.age);
//	printf("%d\n", s1.id);*/
//	return 0;
//}




////隐形数据转换(计算时按照整形来计算）
////整形提升：按照变量的符号位来进行补充
//int main()
//{
//	char a = 3;    //00000011->00000000000000000000000000000011
//	char b = 127;  //01111111->00000000000000000000000001111111
//	char c = a + b;//10000010->11111111111111111111111110000010整形提升，负数的补码
//	printf("%d", c);//11111111111111111111111110000010->10000000000000000000000001111101
//	return 0;//                   反码                               原码
//	
//}



////整形提升，在其它数据类型进行表达式运算时会发生整形提升即其它数据类型转化为整形
//int main()
//{
//	char a = 0xb6;
//	short b = 0xb600;
//	int c = 0xb6000000;
//	if (a == 0xb6)
//		printf("a");
//	else if (b == 0xb600)
//		printf("b");
//	else if (c == 0xb6000000)
//		printf("c");
//	return 0;
//
//}



//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c));
//	printf("%u\n", sizeof(+c));//在其它数据类型进行表达式运算时会发生整形提升即其它数据类型转化为整形
//	printf("%u\n", sizeof(!c));
//	return 0;
//}